Tekla Open API Reference for Tekla Structures 2025
SaveLoad.AttributesSaved Event
 The AttributesSaved event is triggered just after attributes are saved to a file.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler AttributesSaved
Public Event AttributesSaved As EventHandler
Value
Type: System.EventHandler
See Also
Reference
SaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace